list_1 = ['зима', 'зима', 'весна', 'весна', 'весна', 'лето', 'лето', 'лето', 'осень', 'осень', 'осень', 'зима']
dict_1 = {
    1: "зима",
    2: "зима",
    3: "весна",
    4: "весна",
    5: "весна",
    6: "лето",
    7: "лето",
    8: "лето",
    9: "осень",
    10: "осень",
    11: "осень",
    12: "зима"
}
month = 0
while True:
    month = int(input('Введите месяц: '))
    if 1 <= month <= 12:
        break

print('Месяц относится к:', list_1[month - 1])
print('Месяц относится к:', dict_1.get(month))
